In [1]:
import pandas as pd

In [2]:
l1 = [1,2,3,4,5,6,7]
s1 = pd.Series(l1)
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [3]:
person1 = {
		"name": ["ABCD", "XYZ"],
		"age": [25, 22],
		"job": ["SD", "SDE"]
		}
df1 = pd.DataFrame(person1)
df1

   name  age  job
0  ABCD   25   SD
1   XYZ   22  SDE

## From Dictionary

In [4]:
df2 = pd.DataFrame({
		"name": ["ABCD", "XYZ"],
		"age": [25, 22],
		"job": ["SD", "SDE"]
		})
df2

   name  age  job
0  ABCD   25   SD
1   XYZ   22  SDE

## From List

In [5]:
df3 = pd.DataFrame([[1,2,3,4], [5,6,7,8]])
df3

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [6]:
df3 = pd.DataFrame([[1,2,3,4], [5,6,7,8]], columns=['A', 'B','C','D'])
df3

   A  B  C  D
0  1  2  3  4
1  5  6  7  8

## From NumPy array

In [7]:
import numpy as np

In [8]:
arr1 = np.array([[1,2,3,4,5], [6,7,8,9,10]])

In [9]:
df4 = pd.DataFrame(arr1, columns=['A','B','C','D','E'])
df4

   A  B  C  D   E
0  1  2  3  4   5
1  6  7  8  9  10

## from excel/CSV/json

In [10]:
df5 = pd.read_csv('customers-100.csv')
df5

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1.0,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,NaN,Chile,NaN,397.884.0519x718,zunigavanessa@smith.info,24-08-2020,http://www.stephenson.com/
1,2.0,1Ef7b82A4CAAD10,Preston,Lozano,NaN,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,23-04-2021,http://www.hobbs.com/
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,beckycarr@hogan.com,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5.0,053d585Ab6b3159,Joanna,NaN,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,17-04-2021,https://goodwin-ingram.com/
...,...,...,...,...,...,...,...,...,...,...,...,...
95,96.0,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,30-01-2022,http://hayes-perez.com/
96,97.0,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,-3769,605.413.3198,vkemp@ferrell.com,10-07-2021,https://novak-allison.com/
97,98.0,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,+1-632-666-7507x92121,swagner@kane.org,18-09-2021,https://www.ross.com/
98,99.0,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,11-08-2021,http://watkins.info/
99,100.0,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,11-03-2020,http://www.hatfield-saunders.net/

In [11]:
df6 = pd.read_excel('file_example.xls')
df6

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6  7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7  8    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

In [12]:
df7 = pd.read_json('data.json')

,_id,title,author,basePrice,finalPrice,banner,details,publishedDate,rating,__v,category
0,{'$oid': '6943f616089253e26832feeb'},Harry Potter,J. K. Rowling,1200,899,https://ritikart.com/cdn/shop/files/1_7a0681a0...,Dive into the magical world of Harry Potter wi...,{'$date': '2000-10-08T18:30:00.000Z'},4.4,0,{'$oid': '6943f9a0051c5bad487628a6'}

## From List of Tupple

In [13]:
data = [(1, "Smith", 25),
        (2, "Allen", 22),
        (3, "Jane", 23)]
df8 = pd.DataFrame(data, columns=["S.N", "Name", "Age"])
df8

   S.N   Name  Age
0    1  Smith   25
1    2  Allen   22
2    3   Jane   23

## From List of disctionary

In [17]:
data2 = [{"name":"Smith", "age": 23, "Job": "SDE"},
         {"name":"Jane","age": 25,"Job": "SDE"},
         {"Job": "SDE"}]
df9 = pd.DataFrame(data2)
df9

    name   age  Job
0  Smith  23.0  SDE
1   Jane  25.0  SDE
2    NaN   NaN  SDE